 # INTRODUCTION

In this notebook we will scrap the website  https://www.hubertiming.com/results/2020FavoritePlace.  It is a website that is used to show the racing events going in Oregon united states. It displays the schedule of racing events that are upcoming and also the result of the recently happened race. We will do scrapping for the result of 2020 Favorite Place.
Before starting have a look at the website to get an insight into it.

First, we will see the scraping part  - Import python libraries needed for scraping

In [2]:
import requests    #this python library allow us to make HTTP requests .

In [3]:
from bs4 import BeautifulSoup  #Beautiful Soup is a Python library for pulling data out of HTML and XML files.

In [4]:
url = "https://www.hubertiming.com/results/2020FavoritePlace"  #variable to store url

Now HTTP has different methods to perform the desired operation on a specified resource. As we want to extract or retrieve data from the website we will use get method. Thus , we made our first request.It returns a response which we will store in the response variable.

In [5]:
response = requests.get(url)

In [6]:
#We will make BeautifulSoup object, which represents the document as a nested data structure.
#Using lxml as a parser.
#response.text  contain the response text  
#Thus ,we havebs4 object containing response content parsed in lxml tree format

soup = BeautifulSoup(response.text,"lxml")

In [7]:
type(soup)

bs4.BeautifulSoup

In [8]:
#Now we will use the soup object to acces website content 
#we can select title tag of html to display title of page  as every website has only one tag.

title = soup.select('title')

In [9]:
print(title)

[<title>Race results for the 2020 Favorite Place 50K!</title>]

In [15]:
#if you inspect the page you will find that the table containg all data is having id = "individualResults"
# we will get that id content and store it in table variable

table = soup.find(id="individualResults")
#print(table)   #to display  content under table tag remove comment and try

In [11]:
#A basic table structure in html looks like:

#<table>
 #<thead>
    #<tr>
      #<th></th>
    #</tr>
 #</thead>
 #<tbody>
   #<tr>
      #<td></td>
   #</tr>
#</tbody>
#</table>

#Here the table does not have a footer.

In [16]:
#From table now we will find all table row from table by tag 'tr'

table_row  = table.find_all('tr')
print(table_row[2])  #display first two row

<tr>
<td>2</td>
<td>222</td>
<td>
<img class="rounded-circle avatar" src="/results/avatars?bib=222&amp;raceId=1731"/>

                    JOEL SEATON

                </td>
<td>M</td>
<td>36</td>
<td>SAN FRANCISCO</td>
<td>CA</td>
<td>3</td>
<td>
31.07 miles
                            <span class="progress" style="height: 20px;">
<div aria-valuemax="100" aria-valuemin="0" aria-valuenow="100" class="progress-bar" role="progressbar" style="width: 100%;">
                                    100 %
                                </div>
</span>
</td>
<td>3:45:44</td>
<td>7:15</td>
</tr>

In [19]:
#From table row we need table data for that we will find all td tag and store there text in rows as list
rows = []
for tr in table_row:
    td = tr.find_all('td')
    row  = [i.text for i in td]
    rows.append(row)
    
print(rows[2])   #display 2nd row

['2', '222', '\n\r\n\r\n                    JOEL SEATON\r\n\r\n                ', 'M', '36', 'SAN FRANCISCO', 'CA', '3', '\r\n31.07 miles\r\n                            \n\r\n                                    100 %\r\n                                \n\n', '3:45:44', '7:15']

In [233]:
#for table comlumn heading we need tag th
for tr in table_row:
    th = tr.find_all('th')
    head = [i.text for i in th]
    print(head)
    break

['Place', 'Bib', 'Name', 'Gender', 'Age', 'City', 'State', 'Splits', 'Distance', 'Time', 'Pace']

In [234]:
del(rows[0]) #as 0th index list in rows is null remove it

In [20]:
#print(rows)  
#remove comment and see

As now we have all table data in list of list  form we will convert it into dataframe through pandas.

In [236]:
import pandas as pd

In [237]:
df = pd.DataFrame(rows) # converting rows to dataframe

In [238]:
df.columns=head         #our dataframe should contain column heading df.columns does this

In [239]:
df.head()              #print first 5 rows of df.

,Place,Bib,Name,Gender,Age,City,State,Splits,Distance,Time,Pace
0,1,100,\n\r\n\r\n JULI ADELMAN\r\n...,F,40,PORTLAND,OR,5,\r\n31.07 miles\r\n ...,3:42:28,7:09
1,2,222,\n\r\n\r\n JOEL SEATON\r\n\...,M,36,SAN FRANCISCO,CA,3,\r\n31.07 miles\r\n ...,3:45:44,7:15
2,3,248,\n\r\n\r\n RYAN MCLAUGHLIN\...,M,31,BEND,OR,5,\r\n31.07 miles\r\n ...,3:57:44,7:39
3,4,142,\n\r\n\r\n KAITLIN GREENE\r...,F,30,BEND,OR,5,\r\n31.07 miles\r\n ...,4:07:06,7:57
4,5,204,\n\r\n\r\n ANNIE RADECKI\r\...,F,39,PORTLAND,OR,5,\r\n31.07 miles\r\n ...,4:09:16,8:01

You will observe that column Name and Distance contain \n and \r, we need to replace it by replace method .

In [240]:
df = df.replace('\n','', regex=True)
df = df.replace('\r','', regex=True)

In [241]:
df.head()

,Place,Bib,Name,Gender,Age,City,State,Splits,Distance,Time,Pace
0,1,100,JULI ADELMAN,F,40,PORTLAND,OR,5,31.07 miles ...,3:42:28,7:09
1,2,222,JOEL SEATON,M,36,SAN FRANCISCO,CA,3,31.07 miles ...,3:45:44,7:15
2,3,248,RYAN MCLAUGHLIN ...,M,31,BEND,OR,5,31.07 miles ...,3:57:44,7:39
3,4,142,KAITLIN GREENE ...,F,30,BEND,OR,5,31.07 miles ...,4:07:06,7:57
4,5,204,ANNIE RADECKI,F,39,PORTLAND,OR,5,31.07 miles ...,4:09:16,8:01

In [242]:
print(df.loc[1,:])  #print 1st row of df

Place                                                       2
Bib                                                       222
Name                              JOEL SEATON
Gender                                                      M
Age                                                        36
City                                            SAN FRANCISCO
State                                                      CA
Splits                                                      3
Distance    31.07 miles                                   ...
Time                                                  3:45:44
Pace                                                     7:15
Name: 1, dtype: object

Our Column "Name" , "Distance" contain unnecessary white space that has to be removed

In [243]:
df['Name'] = df['Name'].str.replace(" ","")   
df['Distance'] = df['Distance'].str.replace(" ","")

In [244]:
print(df.loc[1,:])  #now it looks fine

Place                    2
Bib                    222
Name            JOELSEATON
Gender                   M
Age                     36
City         SAN FRANCISCO
State                   CA
Splits                   3
Distance    31.07miles100%
Time               3:45:44
Pace                  7:15
Name: 1, dtype: object

Our Column "Distance" contain miles... in it we need to remove that .
we will do this by spliting the string at 'm' and taking 0th index from the list returned.

In [245]:
df['Distance'] = df['Distance'].str.split('m').str[0]

In [246]:
print(df.loc[1,:]) #Now it's awesome

Place                   2
Bib                   222
Name           JOELSEATON
Gender                  M
Age                    36
City        SAN FRANCISCO
State                  CA
Splits                  3
Distance            31.07
Time              3:45:44
Pace                 7:15
Name: 1, dtype: object

In [247]:
df.tail(10) #display last 10 rows of df

,Place,Bib,Name,Gender,Age,City,State,Splits,Distance,Time,Pace
237,238,309,TIMOTHYLOCK,M,39,HOPE,ME,4,30.21,5:12:35,10:20
238,239,107,PHILIPPEBOUTROS,M,28,PORTLAND,OR,1,30,4:50:00,9:40
239,240,256,MAGGIECONVERSE,F,36,PORTLAND,OR,9,28.95,7:37:47,15:48
240,241,111,VERONICABRUMMELL,F,33,VANCOUVER,WA,3,27.35,4:54:39,10:46
241,242,329,JESSICAROLAK,F,32,LOS ANGELES,CA,8,22.34,8:05:44,21:44
242,243,263,THONIAMARTUSHEV,F,25,BEAVERTON,OR,4,18.27,3:28:15,11:23
243,244,368,CHIPMACALPINE,M,42,BEAVERTON,OR,1,15.6,3:07:48,12:02
244,245,218,RENAESAAGER,F,33,MILTON FREEWATER,OR,3,13.86,3:14:30,14:01
245,246,287,ROBGRAHAM,M,43,BEND,OR,3,10.1,1:46:44,10:34
246,247,196,HUNTERNORDHAUSER,M,32,DENVER,CO,7,10.01,1:45:34,10:32

In [248]:
df.shape

(247, 11)

In [249]:
df.info

<bound method DataFrame.info of     Place  Bib              Name Gender Age              City State Splits  \
0       1  100       JULIADELMAN      F  40          PORTLAND    OR      5
1       2  222        JOELSEATON      M  36     SAN FRANCISCO    CA      3
2       3  248    RYANMCLAUGHLIN      M  31              BEND    OR      5
3       4  142     KAITLINGREENE      F  30              BEND    OR      5
4       5  204      ANNIERADECKI      F  39          PORTLAND    OR      5
..    ...  ...               ...    ...  ..               ...   ...    ...
242   243  263   THONIAMARTUSHEV      F  25         BEAVERTON    OR      4
243   244  368     CHIPMACALPINE      M  42         BEAVERTON    OR      1
244   245  218       RENAESAAGER      F  33  MILTON FREEWATER    OR      3
245   246  287         ROBGRAHAM      M  43              BEND    OR      3
246   247  196  HUNTERNORDHAUSER      M  32            DENVER    CO      7

    Distance     Time   Pace
0      31.07  3:42:28   7:09
1      31.07  3:45:44   7:15
2      31.07  3:57:44   7:39
3      31.07  4:07:06   7:57
4      31.07  4:09:16   8:01
..       ...      ...    ...
242    18.27  3:28:15  11:23
243     15.6  3:07:48  12:02
244    13.86  3:14:30  14:01
245     10.1  1:46:44  10:34
246    10.01  1:45:34  10:32

[247 rows x 11 columns]>

### we are done with it 😊!